cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ag'
brew 'coreutils'
brew 'grc'
brew 'htop'
brew 'imagemagick'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'unrar'
brew 'wget'
brew 'cowsay'
brew 'watch'
brew 'tree'
brew 'fasd'
brew 'redis'

# python pip setuptools
brew 'python'
#tmux
brew 'tmux'
# macvim
brew 'macvim' , args: ['with-lua' 'with-override-system-vim']
# Fish-like fast/unobtrusive autosuggestions for zsh.
brew 'zsh-autosuggestions'
# Fish shell like syntax highlighting for zsh
brew 'zsh-syntax-highlighting'
# Additional completion definitions for zsh
brew 'zsh-completions'
# Set of tools like n-history – multi-word history searcher, n-cd – directory bookmark manager, n-kill – htop like kill utility, and more
brew 'zsh-navigation-tools'
# Mac clipboard integration
brew 'reattach-to-user-namespace'
#IRC client
brew 'irssi'

cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'transmission'
cask 'vlc'
cask 'iterm2'
# Secure tunnels to localhost
cask 'ngrok'
