cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'grc'
brew 'imagemagick'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'unrar'
brew 'wget'
brew 'python'

# Fish-like fast/unobtrusive autosuggestions for zsh.
brew 'zsh-autosuggestions'
# Fish shell like syntax highlighting for zsh
brew 'zsh-syntax-highlighting'
# Additional completion definitions for zsh
brew 'zsh-completions'
# Set of tools like n-history – multi-word history searcher, n-cd – directory bookmark manager, n-kill – htop like kill utility, and more
brew 'zsh-navigation-tools'

cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'transmission'
cask 'vlc'
